# Name Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RibbonPanel..::..Name Property
RibbonPanel Class See Also
---
Gets or sets the name of the RibbonPanel.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public string Name { get; set; }
```

Visual Basic
---
```text
Public Property Name As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ Name {
	String^ get ();
	void set (String^ value);
}
```

# Remarks
The name will be displayed on the panel if the Text is not set.
# See Also
RibbonPanel Class
Autodesk.Revit.UI Namespace